Tekla Open API Reference for Tekla Structures 2025
InputObjectDependencyAttribute Properties
The InputObjectDependencyAttribute type exposes the following members.
Properties
Name | Description
Type
 Returns the type of the input object dependency.
Top
See Also
Reference
InputObjectDependencyAttribute Class
Tekla.Structures.Plugins Namespace